[{"title":"My Profile","slug":"My-Profile","date":"2023-10-21T20:47:06.000Z","updated":"2023-10-21T21:51:34.591Z","comments":true,"path":"2023/10/21/My-Profile/","link":"","permalink":"http://example.com/2023/10/21/My-Profile/","excerpt":"","text":"PERSONAL Chaohui Guo&#x2F;Male&#x2F;1997 Ph.D. Candidate in Chatbots, Vrije University Amsterdam, 2027 Contact Phone Number：(+31) 686385352, (+86) 13563929132 Email：&#x63;&#104;&#97;&#111;&#104;&#117;&#x69;&#x2e;&#x67;&#x75;&#111;&#46;&#x63;&#110;&#64;&#x67;&#x6d;&#x61;&#x69;&#108;&#x2e;&#99;&#x6f;&#109; Wechat: guochaohui0210 EducationBachelor’s Degree: Qilu University of Technology, ‘Big Data‘ (2015~2019)Master’s Degree: Beijing University of Technology, ‘Q&amp;A System for Mental Health‘ (2020~2023)Doctor’s Degree: Vrije University Amsterdam, ‘Chatbots for Mental Health‘ (2023~) Awards and Honors Awarded the First Prize of Shandong Province Software Design Competition 2017 Awarded the First Beijing University of Technology’s Prize Scholarship 2020-2021 Awarded the Outstanding Graduate Award 2021-2022 Awarded the First Tech Innovation Prize Scholarship 2022 Awarded the Excellent Tech Innovation Prize Scholarship 2022 Awarded the National Scholarship 2022 Awarded the Excellent Tech Innovation Prize Scholarship 2023 Awarded the Top 100 Graduate of Beijing University of Technology 2023 Awarded the Outstanding Graduate of Beijing 2023 Awarded the Outstanding Graduate of Beijing University of Technology 2023 Research papers: 1 SCI (Q2) paper, 1 SCI (Q4) paper, 1 EI paper and 1 Chinese paper Project Experiences In 2020, participate in the 14th Five-Year Plan of Informatization of the Disabled Persons’ Federation. From 2020 to 2021, participate in the closing work of the 2021 Overseas High-Level Talents Funding Scheme. In 2021, assisted my tutor in the preparation and holding of the “2021 China-Netherlands Smart City Academic Forum”. In 2021, assisted the tutor in guiding 2 undergraduates to complete the graduation project. From 2021 to 2022, participated in the planning of “Web3 + eye treatment Project”, “Web3 + digital pension Project”, and “campus epidemic prevention and Traceability System Project”. From 2021 to 2022, participated in the project team organized by the tutor to carry out the design and research of the “Campus Epidemic Prevention and Traceability System Project”. In 2022, an analysis of the interdisciplinary and team achievements at Beijing University of Technology. From 2021 to 2022, participate in the teaching assistant work, assist the tutor in the teaching preparation and implementation of the experimental course of “Cloud Service Engineering”, and assist the tutor in teaching the course “Introduction to Smart City”. ThanksThank you for taking the time to review my resume. I look forward to the opportunity to work with you!","categories":[],"tags":[{"name":"Self","slug":"Self","permalink":"http://example.com/tags/Self/"},{"name":"Introduction","slug":"Introduction","permalink":"http://example.com/tags/Introduction/"},{"name":"Contact","slug":"Contact","permalink":"http://example.com/tags/Contact/"}]}]